- [1. Redis通用命令](#1-redis通用命令)
- [2. String类型](#2-string类型)
- [3. Hash类型](#3-hash类型)
- [4. List类型](#4-list类型)
- [5. Set类型](#5-set类型)
- [6. SortedSet/ZSet类型](#6-sortedsetzset类型)


---
## 1. Redis通用命令

通用指令是部分数据类型的，都可以使用的指令，常见的有：

- `KEYS`：查看符合模板的所有key
- `DEL`：删除一个指定的key
- `EXISTS`：判断key是否存在
- `EXPIRE`：给一个key设置有效期，有效期到期时该key会被自动删除
- `TTL`：查看一个KEY的剩余有效期
- `help`：可以查看一个命令的具体用法

```sh
# 查看keys命令的帮助信息：
127.0.0.1:6379> help keys

KEYS pattern
summary: Find all keys matching the given pattern
since: 1.0.0
group: generic
```



## 2. String类型

根据字符串的格式不同，又可以分为3类：

- string：普通字符串
- int：整数类型，可以做自增、自减操作
- float：浮点类型，可以做自增、自减操作

不管是哪种格式，底层都是字节数组形式存储，只不过是编码方式不同。

字符串类型的最大空间不能超过512m.

```bash
centos7:13>set name Jack
"OK"
centos7:13>set age 20
"OK"
centos7:13>set price 2.5
"OK"
```

数字类型：
- INCR：让一个整型的key自增1
- INCRBY:让一个整型的key自增并指定步长，例如：incrby num 2 让num值自增2
- INCRBYFLOAT：让一个浮点类型的数字自增并指定步长
```
# 整数类型增减：incrby→简化出incr和decr
centos7:13>incrby age -1
"20"
centos7:13>incr age
"21"
centos7:13>decr age
"19"
# 浮点数增减：incrbyfloat
centos7:13>incrbyfloat price 1.1
"3.6"
```


String的常见命令有：
- SET：添加或者修改已经存在的一个String类型的键值对
- MSET：批量添加多个String类型的键值对
- GET：根据key获取String类型的value
- MGET：根据多个key获取多个String类型的value
- SETNX：添加一个String类型的键值对，前提是这个key不存在，否则不执行
- SETEX：添加一个String类型的键值对，并且指定有效期

```bash
# 新增或修改键值对
centos7:13>set name Jack
"OK"
# 默认set设置的是永不过期（-1）
centos7:13>ttl name
"-1"
# 设置过期（秒）
centos7:13>expire name 20
"1"
# ttl显示剩余秒数
centos7:13>ttl name
"16"
# keys 通配符，显示存在的键值对
centos7:13>keys *
1) "name"
# ttl显示剩余秒数为-2，表示不存在
centos7:13>ttl name
"-2"
centos7:13>keys na*
# 一次设置多个键值对
centos7:13>mset k1 v1 k2 v2 k3 v3
"OK"
# 获取值
centos7:13>get k1
"v1"
# 一次获取多个键值对的值
centos7:13>mget k1 k2 k3
1) "v1"
2) "v2"
3) "v3"
# 只能一个一个删除
centos7:13>del k1
"1"
# 是否存在
centos7:13>exists k1
"0"
centos7:13>exists k2
"1"
```
不存在和过期
```bash
# 不存在才新增成功，存在则失败（只能新增）
centos7:13>del name
"1"
centos7:13>setnx name Sam
"1"
centos7:13>setnx name Sam
"0"
centos7:13>del name
"1"
# 同 set + nx
centos7:13>set name Sam nx
"OK"
centos7:13>set name Sam nx
null

# 设置过期（存在或新增）
centos7:13>set name Tom ex 5
"OK"
centos7:13>ttl name
"1"
centos7:13>setex name 5 Tom
"OK"
centos7:13>ttl name
"2"

# 不存在+过期
centos7:13>del name
"1"
centos7:13>set name Tom ex 5 nx
"OK"
```

使用String类型存储转化json的对象，要修改得整体修改。
```
centos7:13>set project:user:1 '{"id":1, "name":"Jack"}'
"OK"
centos7:13>get project:user:1
"{"id":1, "name":"Jack"}"
centos7:13>set project:user:1 '{"id":1, "name":"Jackson"}'
"OK"
```

## 3. Hash类型

Hash类型，也叫散列，其value是一个无序字典，类似于Java中的HashMap结构。

String结构是将对象序列化为JSON字符串后存储，当需要修改对象某个字段时很不方便。Hash结构可以将对象中的每个字段独立存储，可以针对单个字段做CRUD。

Hash的常见命令有：

- HSET key **field** value：添加或者修改hash类型key的field的值
- HGET key field：获取一个hash类型key的field的值
- HMSET：批量添加多个hash类型key的field的值
- HMGET：批量获取多个hash类型key的field的值
- HGETALL：获取一个hash类型的key中的所有的field和value
- HKEYS：获取一个hash类型的key中的所有的field
- HVALS:获取一个hash类型的key中的所有的field value
- HINCRBY、HINCRBYFLOAT
- HSETNX：添加一个hash类型的key的field值，前提是**这个field**不存在，否则不执行

```bash
# 对一个key，分开赋值它的field
centos7:13>hset project:user:2 name Tom
"1"
centos7:13>hset project:user:2 id 2
"1"
# 分别获取field
centos7:13>hget project:user:2 name
"Tom"
centos7:13>hget project:user:2 id
"2"

# 整体赋值field
centos7:13>hset project:item:2 id 2 price 12 name car
"3"
# 整体获取field：一个field name 接一个 field value
centos7:13>hgetall project:item:2
1) "id"
2) "2"
3) "price"
4) "12"
5) "name"
6) "car"

# 获取有哪些field name
centos7:13>hkeys project:item:2
1) "id"
2) "price"
3) "name"

# 获取有哪些field value
centos7:13>hvals project:item:2
1) "2"
2) "12"
3) "car"

# 对某个field的数字类型操作
centos7:13>hincrby project:item:2 price 1
"13"
centos7:13>hset project:item:3 id 3 price 2.5 name basketball
"3"
centos7:13>hincrbyfloat project:item:3 price 1.1
"3.6"
```


## 4. List类型

Redis中的List类型与Java中的LinkedList类似，可以看做是一个双向链表结构。既可以支持正向检索和也可以支持反向检索。

特征也与LinkedList类似：

- 有序
- 元素可以重复
- 插入和删除快
- 查询速度一般



List的常见命令有：

- LPUSH key element ... ：向列表左侧插入一个或多个元素
- LPOP key：移除并返回列表左侧的第一个元素，没有则返回nil
- RPUSH key element ... ：向列表右侧插入一个或多个元素
- RPOP key：移除并返回列表右侧的第一个元素
- LRANGE key star end：返回一段角标范围内的所有元素
- BLPOP和BRPOP：与LPOP和RPOP类似，只不过在没有元素时等待指定时间，而不是直接返回nil

```bash
###### 可以一次push多个元素
centos7:13>lpush characters C
"1"
centos7:13>lpush characters B A
"3"
# 右侧push
centos7:13>rpush characters D E F
"6"

centos7:13>lpop characters
"A"
centos7:13>rpop characters
"F"
centos7:13>blpop characters 5
"B"
centos7:13>brpop characters 5
"E"

...

# 弹出空后再弹出返回null
centos7:13>lpop characters
null

# blpop,rlpop没元素等待5秒，期间有元素输入就弹元素，5秒后没元素就退出
centos7:13>blpop characters 5


###### 查询下标索引，左闭右闭，超出范围不报错，支持负数倒索引
centos7:13>lrange characters 0 2
1) "A"
2) "B"
3) "C"

centos7:13>lrange characters 0 1
1) "A"
2) "B"

# 超出范围不报错
centos7:13>lrange characters 0 5
1) "A"
2) "B"
3) "C"

# 单个元素
centos7:13>lrange characters 0 0
1) "A"

# 负数索引
centos7:13>lrange characters 0 -1
1) "A"
2) "B"
3) "C"

centos7:13>lrange characters -3 -2
1) "A"
2) "B"
```

常用来存储一个有序数据，例如：朋友圈点赞列表，评论列表等。

## 5. Set类型

- 无序
- 保证元素唯一
- 查找快
- 支持交集、并集、差集等功能


Set的常见命令有：

- SADD key member ... ：向set中添加一个或多个元素
- SREM key member ... : 移除set中的指定元素
- SCARD key： 返回set中元素的个数
- SISMEMBER key member：判断一个元素是否存在于set中
- SMEMBERS：获取set中的所有元素
- SINTER key1 key2 ... ：求key1与key2的交集

```bash
centos7:13>sadd s1 a b c
"3"
centos7:13>smembers s1
1) "c"
2) "a"
3) "b"

centos7:13>scard s1
"3"
centos7:13>sismember s1 a
"1"
centos7:13>sismember s1 d
"0"
centos7:13>srem s1 c
"1"
```

两个集合之间的操作：交、差、并
```bash
# 直接重复添加，这就是set
centos7:13>sadd s1 a b c
"1"
centos7:13>sadd s2 b c d
"3"

centos7:13>sinter s1 s2
1) "c"
2) "b"

centos7:13>sdiff s1 s2
1) "a"

centos7:13>sunion s1 s2
1) "b"
2) "c"
3) "a"
4) "d"
```

练习：

1. 将下列数据用Redis的Set集合来存储：

   - 张三的好友有：李四、王五、赵六
   - 李四的好友有：王五、麻子、二狗

2. 利用Set的命令实现下列功能：

   - 计算张三的好友有几人
   - 计算张三和李四有哪些共同好友
   - 查询哪些人是张三的好友却不是李四的好友 
   - 查询张三和李四的好友总共有哪些人
   - 判断李四是否是张三的好友
   - 判断张三是否是李四的好友 ``
   - 将李四从张三的好友列表中移除
```
centos7:13>sadd zs lisi wangwu zhaoliu
"3"
centos7:13>sadd ls wangwu mazi ergou
"3"
centos7:13>scard zs
"3"
centos7:13>sinter zs ls
1) "wangwu"

centos7:13>sdiff zs ls
1) "lisi"
2) "zhaoliu"

centos7:13>sunion zs ls
1) "zhaoliu"
2) "lisi"
3) "mazi"
4) "ergou"
5) "wangwu"

centos7:13>sismember zs lisi
"1"
centos7:13>sismember lisi zs
"0"
centos7:13>srem zs lisi
"1"
```


## 6. SortedSet/ZSet类型

SortedSet中的每一个元素都带有一个score属性，可以基于score属性对元素排序。

SortedSet具备下列特性：

- 可排序
- 元素不重复
- 查询速度快

ZSet和Hash区别如下：

* zset的键是member任意，值score是数字；hash的键和值都是任意值
* zset要根据score排序；hash则无需排序


SortedSet的常见命令有：

- ZADD key score member ... ：添加一个或多个元素到sorted set ，如果已经存在则更新其score值
- ZREM key member：删除sorted set中的一个指定元素
- ZCARD key：获取sorted set中的元素个数
- ZSCORE key member : 获取sorted set中的指定元素的score值
- ZINCRBY key increment member：修改score.
- ZRANK key member：获取sorted set 中的**指定元素的排名**
- ZRANGE key min max：按照score排序后，获取指定**排名范围内的元素**
- ZCOUNT key min max：统计**score值范围内**的**元素个数**
- ZRANGEBYSCORE key min max：按照score排序后，获取指定**score范围内的元素**
- ZDIFF、ZINTER、ZUNION：求差集、交集、并集

注意：所有的排名默认都是升序，如果要降序则在命令的Z后面添加REV即可，例如：

- **升序**获取sorted set 中的指定元素的排名：ZRANK key member

- **降序**获取sorted set 中的指定元素的排名：ZREVRANK key memeber

因为SortedSet的可排序特性，经常被用来实现排行榜这样的功能。


练习题：

将班级的下列学生得分存入Redis的SortedSet中：

Jack 85, Lucy 89, Rose 82, Tom 95, Jerry 78, Amy 92, Miles 76

并实现下列功能：

- 删除Tom同学
- 获取Amy同学的分数
- 给Amy同学加2分
- 获取Amy同学的排名
- 查出成绩前3名的同学
- 查询80分以下有几个学生
- 查出成绩80分以下的所有同学

```bash
centos7:13>zadd stu 85 Jack 89 Lucy 82 Rose 95 Tom 78 Jerry 92 Amy 76 Miles
"7"

centos7:13>zrem stu Tom
"1"
centos7:13>zscore stu Amy
"92"
centos7:13>zincrby stu 2 Amy
"94"
# 正数排名第1
centos7:13>zrevrank stu Amy
"0"
# 倒数排名第6
centos7:13>zrank stu Amy
"5"
# 正数前3名
centos7:13>zrevrange stu 0 2
1) "Amy"
2) "Lucy"
3) "Jack"

centos7:13>zcount stu 0 79
"2"
centos7:13>zrangebyscore stu 0 79
1) "Miles"
2) "Jerry"
```